[NoCoverage] BlockStatement
src/core/ribbon-service/ribbon.service.ts:11:4
 	constructor(
 		@inject(MAIN_IDENTIFIERS.mainPlugin) private readonly mainPlugin: MainPlugin,
 		@inject(DashboardBootstrapService) private readonly dashboardShowService: DashboardBootstrapService
-	) {
-		this.mainPlugin.addRibbonIcon("pie-chart", "Dashboard", () => {
-			dashboardShowService.launchDashboard();
-		});
-	}
+	) {}
 }
 

[NoCoverage] BlockStatement
src/core/ribbon-service/ribbon.service.ts:12:65
 		@inject(MAIN_IDENTIFIERS.mainPlugin) private readonly mainPlugin: MainPlugin,
 		@inject(DashboardBootstrapService) private readonly dashboardShowService: DashboardBootstrapService
 	) {
-		this.mainPlugin.addRibbonIcon("pie-chart", "Dashboard", () => {
-			dashboardShowService.launchDashboard();
-		});
+		this.mainPlugin.addRibbonIcon("pie-chart", "Dashboard", () => {});
 	}
 }
