[Killed] BlockStatement
src/dashboard/dashboard.component.tsx:5:41
 import {useState} from 'react';
 import {Camera} from "lucide-react";
 
-export const DashboardComponent = () => {
-	const [counter, setCounter] = useState(0);
-
-	return (
-		<div data-testid="app">
-			<h1 className="tw-flex tw-bg-amber-50">{counter}</h1>
-			<Camera size={24}/>
-			<button onClick={() => {
-				setCounter(prev => prev + 1);
-			}}>
-				lol
-			</button>
-		</div>
-	);
-};
+export const DashboardComponent = () => {};
 
killedBy: dashboardComponent it should render
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="app"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[NoCoverage] BlockStatement
src/dashboard/dashboard.component.tsx:12:27
 		<div data-testid="app">
 			<h1 className="tw-flex tw-bg-amber-50">{counter}</h1>
 			<Camera size={24}/>
-			<button onClick={() => {
-				setCounter(prev => prev + 1);
-			}}>
+			<button onClick={() => {}}>
 				lol
 			</button>

[NoCoverage] ArithmeticOperator
src/dashboard/dashboard.component.tsx:13:24
 			<h1 className="tw-flex tw-bg-amber-50">{counter}</h1>
 			<Camera size={24}/>
 			<button onClick={() => {
-				setCounter(prev => prev + 1);
+				setCounter(prev => prev - 1);
 			}}>
 				lol

[NoCoverage] ArrowFunction
src/dashboard/dashboard.component.tsx:13:16
 			<h1 className="tw-flex tw-bg-amber-50">{counter}</h1>
 			<Camera size={24}/>
 			<button onClick={() => {
-				setCounter(prev => prev + 1);
+				setCounter(() => undefined);
 			}}>
 				lol
