[NoCoverage] BlockStatement
src/dashboard/dashboard.view.tsx:14:19
         super(leaf);
     }
 
-    getViewType() {
-        return DashboardView.VIEW_TYPE;
-    }
+    getViewType() {}
 
     getIcon(): IconName {

[NoCoverage] BlockStatement
src/dashboard/dashboard.view.tsx:18:25
         return DashboardView.VIEW_TYPE;
     }
 
-    getIcon(): IconName {
-        return 'pie-chart';
-    }
+    getIcon(): IconName {}
 
     getDisplayText() {

[NoCoverage] BlockStatement
src/dashboard/dashboard.view.tsx:22:22
         return 'pie-chart';
     }
 
-    getDisplayText() {
-        return "Dashboard";
-    }
+    getDisplayText() {}
 
     async onOpen() {

[NoCoverage] StringLiteral
src/dashboard/dashboard.view.tsx:23:16
     }
 
     getDisplayText() {
-        return "Dashboard";
+        return "";
     }
 

[NoCoverage] BlockStatement
src/dashboard/dashboard.view.tsx:26:20
         return "Dashboard";
     }
 
-    async onOpen() {
-        this.root.render(
-            <React.StrictMode>
-                <DashboardComponent />
-            </React.StrictMode>
-        );
-    }
+    async onOpen() {}
 
     async onClose() {

[NoCoverage] BlockStatement
src/dashboard/dashboard.view.tsx:34:21
         );
     }
 
-    async onClose() {
-        this.root.unmount()
-    }
+    async onClose() {}
 }
 
