[NoCoverage] BlockStatement
src/dashboard/registerDashboard.service.ts:13:7
     constructor(
         @inject(MAIN_IDENTIFIERS.mainPlugin) private readonly mainPlugin: MainPlugin,
         @inject(DashboardBootstrapService) private readonly dashboardShowService: DashboardBootstrapService
-    ) {
-        this.mainPlugin.registerView(
-            DashboardView.VIEW_TYPE,
-            (leaf) => new DashboardView(leaf)
-        );
-
-        this.dashboardShowService.bootstrapStatus$.subscribe({
-            next: () => {
-                this.activateView().then();
-            }
-        });
-    }
+    ) {}
 
     async activateView() {

[NoCoverage] ArrowFunction
src/dashboard/registerDashboard.service.ts:16:13
     ) {
         this.mainPlugin.registerView(
             DashboardView.VIEW_TYPE,
-            (leaf) => new DashboardView(leaf)
+            () => undefined
         );
 

[NoCoverage] ObjectLiteral
src/dashboard/registerDashboard.service.ts:19:62
             (leaf) => new DashboardView(leaf)
         );
 
-        this.dashboardShowService.bootstrapStatus$.subscribe({
-            next: () => {
-                this.activateView().then();
-            }
-        });
+        this.dashboardShowService.bootstrapStatus$.subscribe({});
     }
 

[NoCoverage] BlockStatement
src/dashboard/registerDashboard.service.ts:20:25
         );
 
         this.dashboardShowService.bootstrapStatus$.subscribe({
-            next: () => {
-                this.activateView().then();
-            }
+            next: () => {}
         });
     }

[NoCoverage] BlockStatement
src/dashboard/registerDashboard.service.ts:26:26
         });
     }
 
-    async activateView() {
-        this.mainPlugin.app.workspace.detachLeavesOfType(DashboardView.VIEW_TYPE);
-
-        await this.mainPlugin.app.workspace.getLeaf(false).setViewState({
-            type: DashboardView.VIEW_TYPE,
-            active: true,
-        });
-
-        this.mainPlugin.app.workspace.revealLeaf(
-            this.mainPlugin.app.workspace.getLeavesOfType(DashboardView.VIEW_TYPE)[0]
-        );
-    }
+    async activateView() {}
 }
 

[NoCoverage] BooleanLiteral
src/dashboard/registerDashboard.service.ts:29:53
     async activateView() {
         this.mainPlugin.app.workspace.detachLeavesOfType(DashboardView.VIEW_TYPE);
 
-        await this.mainPlugin.app.workspace.getLeaf(false).setViewState({
+        await this.mainPlugin.app.workspace.getLeaf(true).setViewState({
             type: DashboardView.VIEW_TYPE,
             active: true,

[NoCoverage] ObjectLiteral
src/dashboard/registerDashboard.service.ts:29:73
     async activateView() {
         this.mainPlugin.app.workspace.detachLeavesOfType(DashboardView.VIEW_TYPE);
 
-        await this.mainPlugin.app.workspace.getLeaf(false).setViewState({
-            type: DashboardView.VIEW_TYPE,
-            active: true,
-        });
+        await this.mainPlugin.app.workspace.getLeaf(false).setViewState({});
 
         this.mainPlugin.app.workspace.revealLeaf(

[NoCoverage] BooleanLiteral
src/dashboard/registerDashboard.service.ts:31:21
 
         await this.mainPlugin.app.workspace.getLeaf(false).setViewState({
             type: DashboardView.VIEW_TYPE,
-            active: true,
+            active: false,
         });
 
