[Killed] BlockStatement
src/core/dashboard-bootstrap-service/dashboardBootstrap.service.ts:8:50
 export default class DashboardBootstrapService {
 	readonly #bootstrapStatus$ = new Subject<null>();
 
-	public get bootstrapStatus$(): Observable<null> {
-		return this.#bootstrapStatus$.asObservable();
-	}
+	public get bootstrapStatus$(): Observable<null> {}
 
 	public launchDashboard() {
killedBy: DashboardBootstrapService it should notify and emit values through showApp$
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Timeout] BlockStatement
src/core/dashboard-bootstrap-service/dashboardBootstrap.service.ts:12:27
 		return this.#bootstrapStatus$.asObservable();
 	}
 
-	public launchDashboard() {
-		this.#bootstrapStatus$.next(null);
-	}
+	public launchDashboard() {}
 }
 
